Revit 2027 API
BuiltInFailures.SketchFailures.ConstantHeightNotParallel Property
 Constant-height-defining lines must be parallel.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ConstantHeightNotParallel { get; }
Public Shared ReadOnly Property ConstantHeightNotParallel As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ConstantHeightNotParallel {
	FailureDefinitionId^ get ();
}
static member ConstantHeightNotParallel : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace